Revit 2027 API
Mullion.JoinMullion Method
 This method is used to control the join condition the current Mullion with its neighboring mullions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void JoinMullion()
Public Sub JoinMullion
public:
void JoinMullion()
member JoinMullion : unit -> unit
Remarks
 The mullions being perpendicular to it will be broken accordingly.
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace